## Pandas Day - 16

### pivot_table()
- **pivot_table()** is used to summarize and aggregate data in a table format.

In [1]:
import pandas as pd

### Creating Sample Data

In [3]:
df = pd.DataFrame({
    "Name": ["Amit", "Amit", "Rahul", "Rahul"],
    "Subject": ["Maths", "Science", "Maths", "Science"],
    "Marks": [85, 88, 78, 75]
})

In [4]:
df

    Name  Subject  Marks
0   Amit    Maths     85
1   Amit  Science     88
2  Rahul    Maths     78
3  Rahul  Science     75

### Basic pivot_table()

In [6]:
pd.pivot_table(df, values="Marks", index="Name")

       Marks
Name
Amit    86.5
Rahul   76.5

### Using Aggregation Function

In [7]:
pd.pivot_table(df, values="Marks", index="Name", aggfunc="mean")

       Marks
Name
Amit    86.5
Rahul   76.5

### Multiple Aggregations

In [8]:
pd.pivot_table(df, values="Marks", index="Name", aggfunc=["mean", "max"])

       mean   max
      Marks Marks
Name
Amit   86.5    88
Rahul  76.5    78